In [1]:
import pandas as pd

In [4]:
a=[10,20,30,40,50]
sri1=pd.Series(a, index=['a','b','c','d','e'])
print(sri1)
print(sri1.index)
print(sri1.values)
print(sri1.value_counts)
print(sri1.dtype)

a    10
b    20
c    30
d    40
e    50
dtype: int64
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[10 20 30 40 50]
<bound method IndexOpsMixin.value_counts of a    10
b    20
c    30
d    40
e    50
dtype: int64>
int64

In [6]:
b={'홍길동':70, '김승현':85,'박정혁':80}
s1=pd.Series(b)
print(s1)
s1.index=['hong','kim','park']
print(s1.index)
print(s1.values)

홍길동    70
김승현    85
박정혁    80
dtype: int64
Index(['hong', 'kim', 'park'], dtype='object')
[70 85 80]

In [8]:
#값 가져오기
print(s1['hong'])
print(s1[['hong','park']])

70
hong    70
park    80
dtype: int64

In [10]:
#4칙 연산 가능
print(s1+10)

hong    80
kim     95
park    90
dtype: int64

In [11]:
names=['kim','lee','choi','park','jung']
years=[2013,2014,2013,2015,2014]
points=[1.5,1.7,3.6,2.4,2.9]

In [16]:
data={'name':names, 'year':years, 'point': points}
df=pd.DataFrame(data)
# print(df)
df

   name  year  point
0   kim  2013    1.5
1   lee  2014    1.7
2  choi  2013    3.6
3  park  2015    2.4
4  jung  2014    2.9

In [18]:
df1=pd.DataFrame(data, index=['one','two','three','four','five'])
df1

       name  year  point
one     kim  2013    1.5
two     lee  2014    1.7
three  choi  2013    3.6
four   park  2015    2.4
five   jung  2014    2.9

In [21]:
data=[names,years,points]
data

[['kim', 'lee', 'choi', 'park', 'jung'],
 [2013, 2014, 2013, 2015, 2014],
 [1.5, 1.7, 3.6, 2.4, 2.9]]

In [27]:
df2=pd.DataFrame(data)
df2=df2.T       #transpose
df2.columns=['name','year','point']     #columns
df2.index=['one','two','three','four','five']       #index
df2

       name  year point
one     kim  2013   1.5
two     lee  2014   1.7
three  choi  2013   3.6
four   park  2015   2.4
five   jung  2014   2.9

In [31]:
df3=df2[['year','point']]
df3.describe()

        year  point
count      5    5.0
unique     3    5.0
top     2013    1.5
freq       2    1.0

In [34]:
df1.info()
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      int64
 2   point   5 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes
<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      object
 2   point   5 non-null      object
dtypes: object(3)
memory usage: 160.0+ bytes

In [36]:
df2['point']=df2['point'].astype('float32')
df2['year']=df2['year'].astype('int64')
df2.info()
df2.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, one to five
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   year    5 non-null      int64
 2   point   5 non-null      float32
dtypes: float32(1), int64(1), object(1)
memory usage: 312.0+ bytes

             year     point
count     5.00000  5.000000
mean   2013.80000  2.420000
std       0.83666  0.864292
min    2013.00000  1.500000
25%    2013.00000  1.700000
50%    2014.00000  2.400000
75%    2014.00000  2.900000
max    2015.00000  3.600000

In [39]:
name1=df.name
name2=df['name']
print(name1)
print(name2)  #Series 형태로 반환
print(name2.to_list())  #List 형태로 반환

0     kim
1     lee
2    choi
3    park
4    jung
Name: name, dtype: object
0     kim
1     lee
2    choi
3    park
4    jung
Name: name, dtype: object
['kim', 'lee', 'choi', 'park', 'jung']

In [42]:
df[['name','point']]

   name  point
0   kim    1.5
1   lee    1.7
2  choi    3.6
3  park    2.4
4  jung    2.9

In [49]:
df['penalty']=[0.5,0.1,0.3,0.2,0.5]
df['ref']='aa'
df['aa']=[1,2,3,4,5]
print(df['aa'])

print(df.aa)

0    1
1    2
2    3
3    4
4    5
Name: aa, dtype: int64
0    1
1    2
2    3
3    4
4    5
Name: aa, dtype: int64